backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: Embedding
    config:
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 10]
      dtype: float32
      embeddings_constraint: null
      embeddings_initializer:
        class_name: RandomUniform
        config: {dtype: float32, maxval: 0.05, minval: -0.05, seed: null}
      embeddings_regularizer: null
      input_dim: 14445
      input_length: null
      mask_zero: false
      name: embedding_12
      output_dim: 100
      trainable: true
  - class_name: LSTM
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dropout: 0.7
      dtype: float32
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      name: lstm_12
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.7
      recurrent_initializer:
        class_name: Orthogonal
        config: {dtype: float32, gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      time_major: false
      trainable: true
      unit_forget_bias: true
      units: 200
      unroll: false
      use_bias: true
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      name: dense_12
      trainable: true
      units: 9
      use_bias: true
  name: sequential_12
keras_version: 2.2.4-tf
